Autodesk.Revit.DB.Structure.RebarConstraint.GetDirectionFromTargetToConstrainedHandle(System.Boolean)
Gets a direction from target handle to the handle that is obtained by executing this constraint.
treatAsPreferred:
If target rebar joins to the outside of cover, its handle surface's orientation should be revised according to cover reference. If treatAsPreferred is true will ignore the cover;
Returns:
Returns a direction from target handle to the handle that is obtained by executing this constraint.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarConstraint is not using clear bar distance with zero offset to the target rebar.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsValidSurfaceToConstraintHandleTo(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Surface)
Checks if the surface can be used to create a constraint to it for the input handle.
Remarks:
For Free form Rebar:
If the handle doesn't accepts constraint to surface will return false, otherwise will return true.
For Shape driven rebar:
If the input plane is almost perpendicular (the angle between surfaces is between 84 or 96 degrees) will return false.
If the input handle is Rebar Plane or Out Of Plane Extents and the surface isn't a plane will return false.
If the input handle is a segment of a bar whose shape has a RebarShapeDefinitionBySegments definition and the surface isn't a cylinder surface will return false.
For any other cases will return true
handle:
The handle of the rebar that will be constrained.
surface:
The surface that will be tested.
Returns:
Returns true if the surface can be used to create a constraint to it for the input handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.HasAnEdgeNumber
Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint.
Remarks:
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar,' and the
TargetRebarConstraintType must be 'Edge' or 'BarBend'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsHookBend
Returns true if the TargetRebarConstraintType of the RebarConstraint is 'HookBend'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.TargetIsBarBend
Returns true if the TargetRebarConstraintType of the RebarConstraint is 'BarBend'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.IsToHostEdgeCover
Checks if the RebarConstraintType of the RebarConstraint is 'ToHostEdgeCover'.
Returns:
Returns true if the RebarConstraintType of the RebarConstraint is 'ToHostEdgeCover', false otherwise.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.IsToHostEdge
Checks if the RebarConstraintType of the RebarConstraint is 'ToHostEdge'.
Returns:
Returns true if the RebarConstraintType of the RebarConstraint is 'ToHostEdge', false otherwise.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.SetConstraintToRebarEdgeProperties(Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties)
Sets the properties of the constraint to target rebar edges.
properties:
The properties that will be set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input properties are not for an existing target of the constraint.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The TargetRebarConstraintType should be 'Edge'.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.GetConstraintToRebarEdgeProperties
Gets the properties for all target rebar edges.
Returns:
Returns the properties for all target rebar edges.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The TargetRebarConstraintType should be 'Edge'.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.CreateConstraintToRebarEdge(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConstraintToRebarEdgeProperties})
This method creates a constraint of 'ToOtherRebar' type with Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge target type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar, otherwise it will throw exception.
handle:
The handle of the rebar that will be constrained.
allEdgesProperties:
An array containing all target edges to which will be constrained and the constraint properties for each target edge.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
Constrained rebar isn't a Free Form Rebar element.
-or-
The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToOtherRebar type, where target is TargetRebarConstraintType.Edge"/>.
-or-
All targets(TargetRebarEdge) should be different.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.FlipSideForClearBarSpacingZeroDistanceConstraint
Flips the side on which a RebarConstrainedHandle constrained using clear bar distance with zero offset connects to another Rebar target handle.
Remarks:
This is available only for constraints to a Shape Driven Rebar target, using clear bar distance with zero offset.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
-or-
The RebarConstraint is not using clear bar distance with zero offset to the target rebar.
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.GetPositiveOffsetDirectionForToOtherRebarConstraint
Returns the default positive offset direction vector for a constraint to a Shape Driven Rebar.
Remarks:
This is available only for constraints to a Shape Driven Rebar target.
Valid  Autodesk.Revit.DB.Structure.TargetRebarConstraintType are:
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.RebarPlane
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.StartOfBar, only if the RebarShape has a definition of Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsStartConnectorPressent
Autodesk.Revit.DB.Structure.TargetRebarConstraintType.EndOfBar, only if the RebarShape has a definition of Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition with RebarShapeMultiplanarDefinition::IsEndConnectorPressent
Returns:
Returns the default positive offset direction vector.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The TargetRebarConstraintType is not valid.
Since:
2024

Autodesk.Revit.DB.Structure.RebarConstraint.FlipHandleOverTarget
Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.
Remarks:
Throw exception if constraint type is not to a Shape Driven Rebar, or for constraints involving bar/hook bend handle.
Throws exception if the constraint is for a handle of a Free Form Rebar.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToUseClearBarSpacing(System.Boolean)
Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers.
Remarks:
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
Throws exception if the constraint is for a handle of a Free Form Rebar.
useClearBarSpacing:
True if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsUsingClearBarSpacing
Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Remarks:
Throw exception if it's used on start/end handle to start/end handle constraint, and on constraints involving bar/hook bend handle.
Throws exception if the constraint is for a handle of a Free Form Rebar.
Returns:
Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The RebarConstraint constrain two Rebar ends.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetToBindHandleWithTarget(System.Boolean)
Sets the relationship between two RebarConstrainedHandles.
Remarks:
Throws exception for any type of constraint other than 'ToOtherRebar' or if the TargetRebarConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will also throw if the target Rebar has the 'Number with Spacing' layout rule and the TargetRebarConstraintType of the constraint is 'OutOfPlaneExtent'.
Will throw if the target Rebar has the 'CustomSpacing' layout and the formula wil not permit to have a draggable 'OutOfPlaneExtent'.
Throws exception if the constraint is for a handle of a Free Form Rebar.
bindsHandleWithTarget:
False if only the constrained RebarConstrainedHandle follows the target. True if the constrained RebarConstrainedHandle and the target bar handle will be bound and move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
-or-
The TargetRebarConstraintType is 'OutOfPlaneExtent' and the rebar target layout is  either 'Number with Spacing' or 'Custom Spacing with non-variable formula'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsBindingHandleWithTarget
Gets the relationship between two RebarConstrainedHandles.
Remarks:
Throws exception for any type of constraint other than 'ToOtherRebar' or if the TargetRebarConstraintType of the constraint is 'HookBend' or 'BarBend'.
Will throw if the target Rebar has the 'Number with Spacing' layout rule and the TargetRebarConstraintType of the constraint is 'OutOfPlaneExtent'.
Will throw if the target Rebar has the 'CustomSpacing' layout and the formula wil not permit to have a draggable 'OutOfPlaneExtent'.
Throws exception if the constraint is for a handle of a Free Form Rebar.
Returns:
Returns false if only the constrained RebarConstrainedHandle follows the target. Returns true if the constrained RebarConstrainedHandle and the target bar handle are bound and move together.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
-or-
The TargetRebarConstraintType is 'OutOfPlaneExtent' and the rebar target layout is  either 'Number with Spacing' or 'Custom Spacing with non-variable formula'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetRebar(System.Double)
Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface.
Remarks:
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
Throws exception if the constraint is for a handle of a Free Form Rebar.
distanceToTargetRebar:
The distance is given as an offset value, the sign of which depends on the target bar handle direction.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetRebar
Gets the distance from the RebarConstrainedHandle to the target Rebar handle surface.
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
Remarks:
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
Throws exception if the constraint is for a handle of a Free Form Rebar.
Returns:
Returns the distance from the RebarConstrainedHandle to the target Rebar handle surface.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Since:
2020.1

Autodesk.Revit.DB.Structure.RebarConstraint.IsToCustomTarget
Checks if the RebarConstraintType of the RebarConstraint is 'ToCustomTarget'.
Returns:
Returns true if the RebarConstraintType of the RebarConstraint is 'ToCustomTarget', false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToCustomTarget
Gets the distance from the RebarConstrainedHandle to the custom target.
Returns:
Returns the distance from the RebarConstrainedHandle to the custom target.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraintType of the RebarConstraint must be 'ToCustomTarget'.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToCustomTarget(System.Double)
Sets the distance from the RebarConstrainedHandle to the custom target.
distanceToCustomTarget:
The distance to custom target.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToCustomTarget must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraintType of the RebarConstraint must be 'ToCustomTarget'.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.CreateConstraintToCustomTarget(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Double)
This method creates a constraint of 'ToCustomTarget' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar should allow constrains to custom target.
handle:
The handle of the rebar that will be constrained.
distanceToCustomTarget:
The distance to the custom target.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToCustomTarget type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToCustomTarget must be no more than 30000 feet in absolute value.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetHostEdgeCover(System.Double)
Sets the distance from the RebarConstrainedHandle to the target host edge cover.
The RebarConstraintType of the RebarConstraint must be 'ToHostEdgeCover'.
distanceToTargetEdgeCover:
The distance to target host edge cover.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetEdgeCover must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToHostEdgeCover'.
-or-
The RebarConstrainedHandle doesn't allow distance for constraint of Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdge or Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdgeCover type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetHostEdgeCover
Returns the distance from the RebarConstrainedHandle to the target host edge cover.
The RebarConstraintType of the RebarConstraint must be 'ToHostEdgeCover'.
Returns:
Returns the distance from the RebarConstrainedHandle to the target host edge cover.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToHostEdgeCover'.
-or-
The RebarConstrainedHandle doesn't allow distance for constraint of Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdge or Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdgeCover type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.SetDistanceToTargetHostEdge(System.Double)
Sets the distance from the RebarConstrainedHandle to the target host edge.
The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' and must allow offset value.
distanceToTargetEdge:
The distance to target host edge.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distanceToTargetEdge must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToHostEdge'.
-or-
The RebarConstrainedHandle doesn't allow distance for constraint of Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdge or Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdgeCover type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.GetDistanceToTargetHostEdge
Returns the distance from the RebarConstrainedHandle to the target host edge.
The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' and must allow offset value.
Returns:
Returns the distance from the RebarConstrainedHandle to the target host edge.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToHostEdge'.
-or-
The RebarConstrainedHandle doesn't allow distance for constraint of Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdge or Autodesk.Revit.DB.Structure.RebarConstraintType.ToHostEdgeCover type.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostEdgeAndTransform(System.Int32)
Returns the target host edge and the transform that is associated to the host edge's geometry.
The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'.
Only applied to Free Form Rebar.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Returns the target host edge and the transform that is associated to the host edge's geometry.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToHostEdge' or 'ToHostEdgeCover'.
-or-
Constrained rebar isn't a Free Form Rebar element.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.CreateConstraintToHostEdgeCover(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
This method creates a constraint of 'ToHostEdgeCover' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar and must be allowed to constrain to host edges.
The RebarConstrainedHandle that is constrained 'ToHostEdgeCover' must allow offset value.
handle:
The handle of the rebar that will be constrained.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to edges of an element that can host rebar.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
targetReferences is empty.
-or-
The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToHostEdgeCover type.
-or-
targetReferences do not represent edges from the same structural that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.CreateConstraintToHostEdge(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference})
This method creates a constraint of 'ToHostEdge' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Free Form Rebar and must be allowed to constrain to host edges.
handle:
The handle of the rebar that will be constrained.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to edges of an element that can host rebar.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
targetReferences is empty.
-or-
The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToHostEdge type.
-or-
targetReferences do not represent edges from the same structural that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.IsReferenceAValidEdgeForConstraint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Checks if the reference provided can be used in creating 'ToHostEdge' or 'ToHostEdgeCover' constraint.
document:
The document that contains the reference.
targetReference:
The reference to be checked.
Returns:
Returns true if reference can be used in a constraint of 'ToHostEdge' or 'ToHostEdgeCover' type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.IsReferenceAValidFaceForConstraint(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Checks if the reference provided can be used in creating 'ToFace' or 'ToCover' constraints.
Remarks:
Reference is valid if it points to an uncut face of a structural that can host Rebar.
document:
The document that contains the reference.
targetReference:
The reference to be checked.
Returns:
Returns true if reference can be used in a constraint of 'ToFace' or 'ToCover' type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.IsReferenceValidForConstraint(Autodesk.Revit.DB.Reference)
Checks if the reference provided can be used in creating 'ToFace' or 'ToCover' Rebar constraints
Remarks:
Reference is valid if it points to an uncut face of a structural that can host Rebar.
targetReference:
The reference to be checked.
Returns:
Returns true if reference can be used in a constraint of 'ToFace' or 'ToCover' type, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
Since:
2019.1

Autodesk.Revit.DB.Structure.RebarConstraint.ReplaceReferenceTargets(System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},Autodesk.Revit.DB.Structure.RebarConstraintType)
Replaces the current set of references, with the newly provided ones.
Will throw exception if this is a constraint for Shape Driven Rebar.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces or edges of elements that can host rebar.
newConstraintType:
The type of constraint to be set. Can only be 'ToCover', 'FixedDistanceToHostFace', 'ToHostEdge' or 'ToHostEdgeCover'.
In case the type is 'ToHostEdge' or 'ToHostEdgeCover' the references must be of edges, otherwise of faces.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetReferences is empty.
-or-
newConstraintType is not 'ToHostEdge', 'ToHostEdgeCover', 'ToCover' or 'FixedDistanceToHostFace'.
-or-
targetReferences do not represent edges or faces from structurals that can host rebar.
-or-
The handle of the constraint do not accept this type of constraint.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar isn't a Free Form Rebar element.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.ReplaceReferenceTargets(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
Replaces the current set of references, the type of constraint and the offset value, with the newly provided ones.
Will throw exception if this is a constraint for Shape Driven Rebar.
handle:
The RebarConstrainedHandle that has this constraint.
targetReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
targetReferences is empty.
-or-
targetReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar isn't a Free Form Rebar element.
-or-
The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetCustomHandleTag
Returns the handle tag of the RebarConstrainedHandle.
This is valid only for Free Form Rebar.
Returns:
Returns the handle tag of the RebarConstrainedHandle.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Constrained rebar isn't a Free Form Rebar element.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.CreateConstraintToSurface(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,Autodesk.Revit.DB.Surface)
This method creates a constraint of 'ToSurface' type for a given RebarConstrainedHandle.
The RebarConstrainedHandle should belong to a Shape Driven Rebar, otherwise it will throw exception.
handle:
The handle of the rebar that will be constrained.
surface:
The surface that will be used by the constraint.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
handle is no longer valid.
-or-
-or-
The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.ToSurface type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.Structure.RebarConstraint.Create(Autodesk.Revit.DB.Structure.RebarConstrainedHandle,System.Collections.Generic.IList{Autodesk.Revit.DB.Reference},System.Boolean,System.Double)
This method creates a constraint of 'ToHostFace' or 'ToCover' type for a given RebarConstrainedHandle.
Using this method for Shape-Driven Rebar will throw exception. If you need a new RebarConstraint for a handle of a Shape-Driven Rebar, you can obtain a list of possible constraints using one of the RebarConstraintsManager.GetConstraintCandidatesForHandle functions, choose the desired one, and set it as preferred.
handle:
The handle of the rebar that will be constrained. This handle should not be allowed to constrain to an edge.
targetHostFaceReferences:
The references to which the rebar handle will be constrained.
This collection must contain one or more references to faces of elements that can host rebar.
isConstraintToCover:
If true the RebarConstraintType will be set to ToCover, otherwise RebarConstraintType will be set to FixedDistanceToHostFace.
offsetValue:
The distance from references to the rebar handle.
Returns:
Returns the newly created RebarConstraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Constrained rebar isn't a Free Form Rebar element.
-or-
handle is no longer valid.
-or-
targetHostFaceReferences is empty.
-or-
The RebarConstrainedHandle doesn't allow constraint of RebarConstraintType.FixedDistanceToHostFace or RebarConstraintTypeToCover type.
-or-
targetHostFaceReferences do not represent faces from structurals that can host rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarHandleBehavior
Gets the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'.
Returns:
Returns the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
Since:
2026

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarAngleOnBarOrHookBend
Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.
Remarks:
Only applies to RebarConstraints with TargetRebarConstraintType BarBend or HookBend.
For HookBends, values can be 0, 1, 2, 3 or 4, representing angular locations of 0, 45, 90, 135,
and 180 degrees around the hook, starting at the 'base' of the hook (or end of the bar without hook).
For interior BarBends, values can 0 or 1, where 0 means at the intersection of the bar bend and the edge
specified by getTargetRebarEdgeNumber, and 1 means the mid-point of the bend arc.
Rebar must be Shape Driven Rebar element.
Returns:
The angular increment relative to the reference bar edge.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The TargetRebarConstraintType is not 'HookBend' or 'BarBend'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarHookBarEnd
Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'HookBend'.
Rebar must be Shape Driven Rebar element.
Remarks:
0 means start of the bar, and 1 indicates end of the bar.
Returns:
Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The TargetRebarConstraintType is not 'HookBend'
-or-
Constrained rebar isn't a Shape Driven Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarBendNumber
Gets the number of the bend on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'BarBend'.
Rebar must be Shape Driven Rebar element.
Returns:
Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
The TargetRebarConstraintType is not 'BarBend'
-or-
Constrained rebar isn't a Shape Driven Rebar element.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarEdgeNumber
Gets the number of the edge on the other Rebar Element to which this RebarConstraint is attached.
The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType
must be 'Edge'.
Rebar must be Shape Driven Rebar element.
Returns:
Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
-or-
Constrained rebar isn't a Shape Driven Rebar element.
-or-
The RebarConstraint is not attached to an edge, or bend, or hook bend of another Rebar Element, or it's attached to multiple edges.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetRebarConstraintType
Gets the TargetRebarConstraintType of the handle on the other Rebar Element
to which this RebarConstraint is attached. The RebarConstraintType of the
RebarConstraint must be 'ToOtherRebar'.
Returns:
Returns the TargetRebarConstraintType of the handle on the other Rebar Element
to which this RebarConstraint is attached.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetHostFaceReferenceForEdgeConstraint(System.Int32,System.Int32)
Returns a reference to the host Element face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex.
The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
faceIndex:
The face index of the edge. Should be 0 or 1.
Returns:
Returns a reference to the host Element face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
-or-
faceIndex must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToHostEdge' or 'ToHostEdgeCover'.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetCoverTypeForToHostEdgeConstraint(System.Int32,System.Int32)
Returns the RebarCoverType for the face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex.
The RebarConstraintType of the RebarConstraint must be 'ToHostEdge' or 'ToHostEdgeCover'.
Returns null if no RebarHostData is present for target element.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
faceIndex:
The face index of the edge. Should be 0 or 1.
Returns:
Returns the RebarCoverType for the face provided at faceIndex, that forms the edge of this RebarConstraint at the specified targetIndex.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
-or-
faceIndex must be 0 or 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint is not of RebarConstraintType 'ToHostEdge' or 'ToHostEdgeCover'.
Since:
2027

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetElement
Gets the Element object (either Host or Rebar) which provides the target reference at index 0 for this constraint.
Will throw exception if it's a multi target constraint.
Returns:
Returns the Element object (either Host or Rebar) which provides the target reference at index 0 for this constraint.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
Multi target constraint. Consider using the indexed version of the method.
-or-
The RebarConstraint should not be of RebarConstraintType 'ToSurface'.
-or-
The RebarConstraintType of the RebarConstraint is 'ToCustomTarget'.
Since:
2014

Autodesk.Revit.DB.Structure.RebarConstraint.GetTargetElement(System.Int32)
Gets the Element object (either Host or Rebar) which provides the target reference at specified index for this constraint.
targetIndex:
The index of the target. Should be between 0 and NumberOfTargets().
Returns:
Returns the Element object (either Host or Rebar) which provides the target reference at specified index for this constraint.
Throws Autodesk.Revit.Exceptions.ArgumentException:
targetIndex is out of range.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
RebarConstraint is no longer valid.
-or-
The RebarConstraint should not be of RebarConstraintType 'ToSurface'.
-or-
The RebarConstraintType of the RebarConstraint is 'ToCustomTarget'.
Since:
2018

Autodesk.Revit.DB.Structure.RebarConstraint
A class representing a constraint on a handle of a rebar element.
Remarks:
For Shape Driven Rebar Constraints:
Each handle on a rebar is defined by a plane, and can be constrained along the
direction perpendicular to a surface. Rebar constraints work by locking the
handle planes to targets. These targets can be: surfaces of host elements (faces or cover),
the handle planes of other Rebar element or any generic surface.
A special case is for of a straight, standard style bar, running perpendicular
to the plane of the stirrup bar. This bar can constrain itself to distinct locations
along bends in stirrup bars - points located at 0 degrees, 45 degrees, 90 degrees,
etc. around each bend. This is done by simultaneously locking both the straight
bar's edge handle and its planar position handle to one or both of the stirrup edges
adjacent to the bend in the stirrup.
Usually, to form a constraint, the handle plane and the reference plane must be parallel.
However, bar end or segment handles can be constrained to planes at angles up to 84 degrees.
Arc-shaped rebar is a special case, and can form constraints to concentric host surfaces.
For Free Form Rebar Constraints:
Each handle of the Rebar can be constrained to multiple host faces, covers of the host faces,
host edges or other Rebar's edges.
There are handles that can have have custom constraints which are specific for each Autodesk::Revit::DB::Structure::IRebarUpdateServer.
RebarConstraints for Free Form Rebar should be created using the specific Create methods and then added to
the RebarConstraintsManager using the method SetPreferredConstraint.
Since:
2014